index=main sourcetype=ssh_raw_logs
| stats count(eval(status="failure")) as failures count(eval(status="success")) as successes by src_ip dest_ip
| where failures > 20 AND successes >= 1
| sort - failures
