index=main sourcetype=ssh_raw_logs status="failure"
| stats count dc(dest_ip) as unique_targets by src_ip
| eval avg_failures_per_target = count/unique_targets
| where unique_targets >= 10 AND avg_failures_per_target <= 5 AND count < 500
| table src_ip count unique_targets avg_failures_per_target
